[
{"postlabels": ["drapino.com", "scam", "0"], "postcontent": ["\n", "\n", "\n", "\n", "\n", "\nHow do you have the audacity to first send the ", " and then ask me to:", "\n", "\n", "\nWhat makes you think I will shop from ", " every again?", "\n", "\n", "\nPlease do one of the following:", "\n", "\n", "\nIf you do not have the authority to act on either of these resolutions, kindly escalate it to your superiors.", "\n", "\n", "\n", "\nIn case either of these resolutions is not taken, I am putting in a formal complaint to a consumer court within this week.", "\n", "\n", "\n", "\n"], "posttitle": ["Drapino.com Scam"]},
{"postlabels": ["bentota", "galle", "sri lanka", "0"], "postcontent": ["\nThis summer, I visited Sri Lanka for my internship and had the opportunity to explore the fantastic island nation. I landed in Colombo when the Sri Lankan new year celebrations were going on (mid April) and therefore decided to take a trip down South to the beautiful little towns of Bentota and Galle.", "\n", "\nInternational Flights from Chennai take about an hour to reach Colombo. From Colombo, you may take a train from the Colombo Fort railway station to Bentota. There are many options in terms of the  International Airlines, with Sri Lankan Airlines providing jumbo jets for the journey.", "\n"], "posttitle": ["Exploring Southern Sri Lanka: Bentota and Galle"]},
{"postlabels": ["MyUnileverDiaries", "sri lanka", "0"], "postcontent": ["\nIt has been almost two months in Sri Lanka, after Unilever decided to send me to conquer this nation for the internship (just kidding!) And here I am with yet another blog post about the experience in a South Asian country unlike any other!", "\n"], "posttitle": ["Sri Lanka - Two Months On!"]},
{"postlabels": ["MyUnileverDiaries", "sri lanka", "0"], "postcontent": ["\nIt has been such a long time since I blogged that I feel something like this Led Zeppelin song - \"been a long time, been a long time, been a long, lonely, lonely, lonely, lonely, lonely time!\"", "\n", "\n", "\n", "\n", "\nAs I was racing towards the other terminal in Chennai, I suddenly realised what I had in store for me. Two months in a foreign country all alone - as if that was not enough, I hadn't slept the night earlier chatting up with some old friends and I was practically in a trance state. By this time, I realize the earlier sentence is getting too long and I need to abort, or risk failing the Flesch test.", "\n", "\nCutting to the chase, I am in Sri Lanka for my internship with Unilever (and I have been given a palatial bungalow - more on that in a later post). I will directly go down to the crux of the matter and let you know what surprised me the most (or least).", "\n"], "posttitle": ["Sri Lanka: First Thoughts"]},
{"postlabels": ["scam", "TrendzVenue", "WearYourStyle", "0"], "postcontent": ["\nA few weeks go, I saw an ad on Facebook for ", " and order 5 T-shirts for Rs. 1700. It took some time to get them, but to my surprise, I was shipped only 4 (even though the invoice mentioned 5 of them!)", "\n", "\nI contacted their customer care through email (when you email contact@wearyourstyle.in, contact@trendvenue.com replies) they asked me which item was missing from my shipment. That was a week ago, and there has been no reply from this on this matter hence."], "posttitle": ["The WearYourStyle.in - TrendzVenue Scam - DO NOT BUY"]},
{"postlabels": ["bergerp", "blogger meet", "0"], "postcontent": ["\n4 years, 4 long years. That's how long Kolkata bloggers have been waited for a blogger meet. Thankfully, I am more of a Nomad and I visited the Kose IndiBlogger Meet, which coincided with my IIM Indore interview. Being that pseudo Kolkatan that I am, I knew about the rich heritage of the Oberoi Grand. Add to it the spice of an IB meet, and I knew missing it would be stupid. What's more? I got my mother into it too.", "\n", "\nIf you know me, you would probably know that I am a developer (yes, I still consider myself one!) and developers are introverts. Introverts are good at blending into a crowd, and not stand out. In the previous meet, I had done so successfully, and managed to talk to others too, but this time I had Mamma with me, which changed the dynamics.", "\n"], "posttitle": ["Kolkata #BergerXP IndiBlogger meet, Marketing Insights, and some Blogging Tips"]},
{"postlabels": ["jump start git", "sitepoint", "0"], "postcontent": ["\nThe title says it all.", "\nWait, what?!? Published? Not self-published, I got published published. If memory serves me correctly, not long ago, I was struggling to complete those writing skill questions back in 12th standard. It's been a long journey since then!"], "posttitle": ["I got Published!"]},
{"postlabels": ["django", "POST", "PUT", "rest api", "0"], "postcontent": [], "posttitle": ["How to use request.PUT or request.DELETE in Django"]},
{"postlabels": ["atk", "football", "isl", "0"], "postcontent": ["\nZico might have been a great footballer, but the White Pele is perhaps one of the best players not to have won a World Cup ever. Maybe that's why he considers ", ". It's commendable how he has engineered the uphill task after a poor start by FC Goa to the tournament.", "\n", "\nThe moment I entered the Salt Lake Stadium, I knew the crowd wasn't going to let Zico go away with a victory, a result that would eliminate the home team Atletico de Kolkata out of the tournament. As the starting XI was being announced, the stadium cheered every name. The presence of 36 year old marquee signing Luis Garcia on the bench, raised doubts on his fitness, but Kolkata seemed to go with whatever they had."], "posttitle": ["Zico, the ISL and ATK"]},
{"postlabels": ["comeback", "0"], "postcontent": ["\nIt's been a long time. A very long time indeed...", "\n", "\nIt's been so long that the once familiar Blogger interface seems alien to me. Due to my sabbatical, I must admit that I had thoughts of leaving this blog altogether and moving on to a new one, but recent events have convinced me otherwise.", "\n", "\nRandom people have asked me why I have stopped blogging. I had no idea so many people read this blog - and that they would miss my posts. But the one thing that wanted me to start writing again on this blog was during a job interview.", "\n", "\nI had cleared the first level of interviews in a company, and the moment I walked into the room, one of the interviewers asked me - \"How is your blog?\" (The fact that I have neglected this blog in recent times might have contributed to me not making it to the said company.)", "\n", "\nApart from my readers reaching out to me in real life, I am going to start writing again because I am fresh out of the placement season at IIT Roorkee - a place where students are only as good as the packages they bag. I have a lot of things in mind - about the placement process, the selection procedure and a lot of other things - and I am going to share them on this blog soon (albeit in a safe way- to make sure I don't get in trouble with certain people).", "\n", "\nTo the readers, I would like to sincerely apologize because I have been away for a long time due to my own selfish reasons (the freelancing pays well, you know!) But watch this space, I am going to share my experience soon."], "posttitle": ["And I'm back!"]}
]